IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_PWMSYNCOUTXBAR_CONTROLSS_PWMSYNCOUTXBAR.xml
<module name="CONTROLSS_PWMSYNCOUTXBAR_CONTROLSS_PWMSYNCOUTXBAR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_PWMSYNCOUTXBAR_PID" acronym="CONTROLSS_PWMSYNCOUTXBAR_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_PWMSYNCOUTXBAR_PWMSYNCOUTXBAR0_G0" acronym="CONTROLSS_PWMSYNCOUTXBAR_PWMSYNCOUTXBAR0_G0" offset="0x100" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="ETPWM pwmsyncout xbar0 select1: PWM[x] SYNCOUT selected0: PWM[x] SYNCOUT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMSYNCOUTXBAR_PWMSYNCOUTXBAR1_G0" acronym="CONTROLSS_PWMSYNCOUTXBAR_PWMSYNCOUTXBAR1_G0" offset="0x140" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="ETPWM pwmsyncout xbar1 select1: PWM[x] SYNCOUT selected0: PWM[x] SYNCOUT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMSYNCOUTXBAR_PWMSYNCOUTXBAR2_G0" acronym="CONTROLSS_PWMSYNCOUTXBAR_PWMSYNCOUTXBAR2_G0" offset="0x180" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="ETPWM pwmsyncout xbar2 select1: PWM[x] SYNCOUT selected0: PWM[x] SYNCOUT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_PWMSYNCOUTXBAR_PWMSYNCOUTXBAR3_G0" acronym="CONTROLSS_PWMSYNCOUTXBAR_PWMSYNCOUTXBAR3_G0" offset="0x1C0" width="32" description="">
		<bitfield id="SEL" width="32" begin="31" end="0" resetval="0x0" description="ETPWM pwmsyncout xbar3 select1: PWM[x] SYNCOUT selected0: PWM[x] SYNCOUT is de-selected" range="31 - 0" rwaccess="RW"/>
	</register>
</module>